benchmarks/http_suite_20260323_202211/wrk_ping_io1_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.94ms    1.50ms  25.88ms   70.18%
    Req/Sec     3.23k   378.43     6.03k    76.25%
  Latency Distribution
     50%    9.92ms
     75%   10.96ms
     90%   11.80ms
     99%   13.09ms
  128595 requests in 5.04s, 14.10MB read
Requests/sec:  25531.30
Transfer/sec:      2.80MB