benchmarks/http_suite_20260323_202211/wrk_ping_short_c256.wrk.out
Running 5s test @ http://127.0.0.1:18080/ping
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.00ms    3.55ms  55.61ms   80.82%
    Req/Sec     1.40k   129.55     1.62k    71.25%
  Latency Distribution
     50%   21.11ms
     75%   22.61ms
     90%   24.28ms
     99%   32.50ms
  56021 requests in 5.05s, 4.65MB read
Requests/sec:  11092.05
Transfer/sec:      0.92MB